Revit 2025 API
FabricationAncillaryType Enumeration
 An enumerated type listing all fabrication ancillary types.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricationAncillaryType
Public Enumeration FabricationAncillaryType
public enum class FabricationAncillaryType
type FabricationAncillaryType
Members
Member name | Value | Description
Unknown | 0 |  Unknown or unsupported ancillary type.
Fixing | 1 |  Ancillary nuts and bolts. Used to fix and bind other ancillaries.
Corner | 2 |  Ancillary corner joints. Used to join ancillary materials."
Clip | 3 |  Ancillary clips and washers. Used to additionally fix and clip ancillaries together.
TieRod | 4 |  Ancillary tie rod types. Used to internally stiffen fittings.
Gasket | 5 |  Ancillary gaskets. Used to seal connector joints.
Sealant | 6 |  Ancillary sealants. Used to seal seams.
SupportRod | 7 |  Ancillary support drop rod types. Used to support fittings.
AncillaryMaterial | 8 |  Ancillary materials used to support and externally stiffen fittings, eg. angle iron, unistrut.
AirturnTrack | 9 |  Ancillary airturn tracks. Used to fasten airturn vanes in place.
AirturnVane | 10 |  Ancillary airturn vanes. Used to manage flow through fittings.
Isolator | 11 |  Ancillary support isolators. Used inline ancillary support rods.
SeamMaterial | 12 |  Ancillary seam material.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace